{
  "changelog": [
    {
      "version": "3.1.88",
      "changes": [
        "Clicking a fleet currently subwarping should no longer result in a white screen"
      ]
    },
    {
      "version": "3.1.87",
      "changes": [
        "Fixed an issue where depositing toolkits or food to a starbase was not possible"
      ]
    },
    {
      "version": "3.1.86",
      "changes": [
        "Fixed an issue where crafting instances from other starbases were showing up in the crafting instances list",
        "Optimised data subscriptions to reduce network traffic"
      ]
    },
    {
      "version": "3.1.84",
      "changes": [
        "Fixed an issue where toggling the overview would crash the page",
        "Fixed an issue causing the map performance to deteriorate"
      ]
    },
    {
      "version": "3.1.82",
      "changes": [
        "SAGE Labs data is now served through Starcomm v2 using Firestore"
      ]
    },
    {
      "version": "3.1.68",
      "changes": [
        "Added a transaction queue sidebar to view transactions and the ability to retry them if they fail",
        "Fixed a rare situation where there would be an SDU crafting instance that could not be removed"
      ]
    },
    {
      "version": "3.1.62",
      "changes": [
        "We've added more priority fee options in the Settings menu"
      ]
    },
    {
      "version": "3.1.59",
      "changes": [
        "Use a different Solana connection based on priority fee setting"
      ]
    },
    {
      "version": "3.1.56",
      "changes": [
        "Allow connecting while the app is loading"
      ]
    },
    {
      "version": "3.1.49",
      "changes": [
        "Hot wallet interactions for passengers should now work"
      ]
    },
    {
      "version": "3.1.47",
      "changes": [
        "Fixed priority fee for ATLAS Prime"
      ]
    },
    {
      "version": "3.1.42",
      "changes": [
        "Use the user's preferred priority fee"
      ]
    },
    {
      "version": "3.1.35",
      "changes": [
        "Fixed a discrepancy in usage of compute unit values for transactions"
      ]
    },
    {
      "version": "3.1.34",
      "changes": [
        "Fixed wallet fee payer using the incorrect signer"
      ]
    },
    {
      "version": "3.1.33",
      "changes": [
        "Fixed more issues regarding certificates for the local markets"
      ]
    },
    {
      "version": "3.1.28",
      "changes": [
        "Added refreshing of starbase player certificate balances to manual refresh"
      ]
    },
    {
      "version": "3.1.26",
      "changes": [
        "Fixed several ongoing issues regarding new wallet architecture"
      ]
    },
    {
      "version": "3.1.22",
      "changes": [
        "Implemented Solana wallet standards and revamped wallet architecture"
      ]
    },
    {
      "version": "3.1.20",
      "changes": [
        "Added a new map visual and sound preview which can be enabled in the settings"
      ]
    },
    {
      "version": "3.1.14",
      "changes": [
        "Fixed another issue with token accounts not being initialized properly"
      ]
    },
    {
      "version": "3.1.13",
      "changes": [
        "Removed duplicate redemption instructions when crafting"
      ]
    },
    {
      "version": "3.1.12",
      "changes": [
        "Fixed several issues regarding trading in the marketplace and token accounts not initializing properly"
      ]
    },
    {
      "version": "3.1.11",
      "changes": [
        "Fixed an issue regarding stale certificate balances"
      ]
    },
    {
      "version": "3.1.9",
      "changes": [
        "Fixed a crash the occurred when a character did not have the points accounts initialized yet"
      ]
    },
    {
      "version": "3.1.8",
      "changes": [
        "The refresh button in the inventory now also refreshes certificate balances"
      ]
    },
    {
      "version": "3.1.7",
      "changes": [
        "Fixed scrolling issues on mobile devices"
      ]
    },
    {
      "version": "3.1.6",
      "changes": [
        "Certificate balances should be included in the starbase inventory now"
      ]
    },
    {
      "version": "3.1.5",
      "changes": [
        "Fixed some small styling issues"
      ]
    },
    {
      "version": "3.1.4",
      "changes": [
        "Added a popup window that lists the locations in your faction where Infrastructure Contracts can potentially be sold"
      ]
    },
    {
      "version": "3.1.2",
      "changes": [
        "Official Star Atlas accounts are now properly displayed in the in-game marketplaces"
      ]
    },
    {
      "version": "3.0.224",
      "changes": [
        "Introduced Faction Infrastructure Contracts, these contracts rotate between 6 sectors per faction, with 3 active at any given time. They can be crafted and sold to their faction for a flat rate of 2 ATLAS.",
        "MUD Infrastructure Contracts will rotate between these 6 locations: MUD-2, MUD-5, MRZ-7, MRZ-8, MRZ-9 and MRZ-12",
        "Ustur Infrastructure Contracts will rotate between these 6 locations: UST-2, UST-5, MRZ-17, MRZ-28, MRZ-32 and MRZ-33",
        "ONI Infrastructure Contract will rotate between these 6 locations: ONI-2, ONI-3, MRZ-26, MRZ-30, MRZ-31 and MRZ-36",
        "The rotation of FIC buy orders will happen every 7 days",
        "All locations currently have the same price, the intention is to change this within the first month after launch"
      ]
    },
    {
      "version": "3.0.221",
      "changes": [
        "Trade resources with other players in Galia's individual sectors through local markets, mini economies within the larger SAGE Labs economy! It's time to build your strategy and dominate these localized trading hubs!"
      ]
    },
    {
      "version": "3.0.199",
      "changes": [
        "Fixed an issue regarding the fee amounts when starting crafting instances.",
        "Increased the amount of SDUs you receive per successful scan by 6x (e.g., A Fimbul Airbike used to return 1 SDU per successful scan, now it returns 6)",
        "Increased the scan cooldown by 6x (e.g., A Fimbul Airbike used to have a scan cooldown of 131 seconds, now it's 786 seconds)",
        "Increased the food required per scan by 6x (e.g., A Fimbul Airbike used to burn 3.6 food per scan, now it burns 22)",
        "Increased the max SDUs per sector by 6x (From 1,200 to 7,200)",
        "Increased the SDU refill time per sector by 6x (From 600 seconds to 3,600 seconds)",
        "Swapped the resources found at MRZ-3 with MRZ-7",
        "Swapped the resources found at MRZ-4 with MRZ-6"
      ]
    },
    {
      "version": "3.0.193",
      "changes": [
        "Fixed an issue where after creating a character the interface could not find the created character."
      ]
    },
    {
      "version": "3.0.191",
      "changes": [
        "Added a recovery mode setting for crafting for users experiencing incomplete deposits and are unable to continue crafting.",
        "Incomplete deposits for crafting will now display a notification dialog with more details on which resources are missing."
      ]
    },
    {
      "version": "3.0.187",
      "changes": [
        "Fixed an issue where importing crew would attempt to register sage player profiles more than once."
      ]
    },
    {
      "version": "3.0.186",
      "changes": [
        "Fixed an issue where crafting processes with partially deposited ingredients due to dropped transactions can be continued."
      ]
    },
    {
      "version": "3.0.185",
      "changes": ["Fixed a regression in handling a fleet's fuel/ammo stored in the cargo hold."]
    },
    {
      "version": "3.0.180",
      "changes": [
        "Fixed a UI issue where interpolated mined cargo exceeded the fleet's cargo capacity."
      ]
    },
    {
      "version": "3.0.177",
      "changes": [
        "Fixed an issue where starbase balances from previously selected starbases are added to current one."
      ]
    },
    {
      "version": "3.0.174",
      "changes": [
        "Fixed an issue where too many crafting instances overflowed in the UI.",
        "Fixed crafting preview calculation for upkept starbases."
      ]
    },
    {
      "version": "3.0.173",
      "changes": ["Migrate account room to Starcomm V2."]
    },
    {
      "version": "3.0.169",
      "changes": ["Fixed an regression where multiple starbase cargo pods weren't being handled."]
    },
    {
      "version": "3.0.168",
      "changes": [
        "Migrated client token balance RPC calls to Starcomm V2.",
        "Improved highlighted tile rendering performance."
      ]
    },
    {
      "version": "3.0.164",
      "changes": [
        "Rework fleet passenger handling in hangar. UI has been updated to display crew number changes more clearly."
      ]
    },
    {
      "version": "3.0.160",
      "changes": [
        "Merkle tree proofs are now validated prior to sending transactions.",
        "Passenger tab shows remaining fleet crew capacity.",
        "Legacy ship withdrawal crew checks have been removed."
      ]
    },
    {
      "version": "3.0.157",
      "changes": [
        "New Fleet Crew Management permission for hotwallets added. You must add this permission to load/unload crew."
      ]
    },
    {
      "version": "3.0.156",
      "changes": ["Crew Phase 2 has been implemented into the game."]
    },
    {
      "version": "3.0.142",
      "changes": [
        "Crew pagination works now.",
        "Fixed an issue where rpc was returning invalid proofs, affecting transfers."
      ]
    },
    {
      "version": "3.0.139",
      "changes": ["Fixed a regression in some dialog views not overflowing properly."]
    },
    {
      "version": "3.0.138",
      "changes": ["Fixed an edge case where transferring crew fails if crew record doesn't exist."]
    },
    {
      "version": "3.0.136",
      "changes": ["Fixed an issue preventing fleets from being formed due to crew count."]
    },
    {
      "version": "3.0.135",
      "changes": [
        "Crew deposit/withdrawal transactions enabled with lookup table.",
        "Fixed an issue where only 1 crew shows up on the wallet."
      ]
    },
    {
      "version": "3.0.134",
      "changes": ["Crew Quarters view and updated Port of Entry."]
    },
    {
      "version": "3.0.129",
      "changes": ["Leftover upgrade processes at maxed out starbases can now be cancelled."]
    },
    {
      "version": "3.0.124",
      "changes": [
        "Fixed an issue in the overview/sector survey tab where scanning SDUs there did not result in any feedback.",
        "Fixed an issue where incorrect starbase and starbase player keys were being used in the transaction if user runs into a 'Seat reservation expired' error joining a room",
        "The LP shown in the top now reflects the daily amount redeemed."
      ]
    },
    {
      "version": "3.0.122",
      "changes": ["Recipe usage limit data is shown now."]
    },
    {
      "version": "3.0.120",
      "changes": [
        "Fixed an issue where longer crafting transactions were failing due to exceeding Solana's 64 instruction limit."
      ]
    },
    {
      "version": "3.0.118",
      "changes": ["Manual LP redemption on the UI is no longer possible."]
    },
    {
      "version": "3.0.116",
      "changes": [
        "Fixed an issue where passing in the wrong profile key index could cause the transaction builder to fail."
      ]
    },
    {
      "version": "3.0.114",
      "changes": [
        "Fixed an issue with hotwallets where the points spending permission was incorrectly being used for vaults."
      ]
    },
    {
      "version": "3.0.112",
      "changes": [
        "Auto LP redemption now works with hotwallets. Permissions MUST be saved again with either upkeep or upgrade selected in order for it to work."
      ]
    },
    {
      "version": "3.0.110",
      "changes": ["Fixed issue with meta crafting recipes appearing in other crafting sections"]
    },
    {
      "version": "3.0.109",
      "changes": [
        "Fixed an issue with creating user redemption accounts with starbase upgrade/upkeep submissions"
      ]
    },
    {
      "version": "3.0.107",
      "changes": ["LP overhaul. Automatic LP contribution to epoch upon LP earning actions."]
    },
    {
      "version": "3.0.106",
      "changes": ["Fixed starbase cargo permissions for hotwallet"]
    },
    {
      "version": "3.0.104",
      "changes": ["Added Meta Crafting Station to the Craft Workshop"]
    },
    {
      "version": "3.0.102",
      "changes": ["Fixed UI crash in Staff Efforts tab"]
    },
    {
      "version": "3.0.98",
      "changes": ["Upgrade RPC cluster configuration to use Ironforge"]
    },
    {
      "version": "3.0.96",
      "changes": ["Fixed incorrect SDU upgrade recipe being used for starbase upgrades"]
    },
    {
      "version": "3.0.91",
      "changes": ["Fixed overview crafting times to match starbase operations view"]
    },
    {
      "version": "3.0.89",
      "changes": ["Fixed preview upgrade duration and completed crafting list calculations"]
    },
    {
      "version": "3.0.86",
      "changes": ["Ships show up in local starbase inventory again"]
    },
    {
      "version": "3.0.85",
      "changes": [
        "Fix an issue where recipes were missing after program updates for recipes on chain"
      ]
    },
    {
      "version": "3.0.83",
      "changes": ["Show Tier 6 recipes at Central Space Station"]
    },
    {
      "version": "3.0.79",
      "changes": [
        "Update crafting duration to track program changes to food upkeep time",
        "Warp buttons disable correctly now if insufficient fuel"
      ]
    },
    {
      "version": "3.0.73",
      "changes": [
        "When ATLAS Prime is enabled the Start Crafting button now checks the Vault balance for sufficient ATLAS instead of the wallet"
      ]
    },
    {
      "version": "3.0.71",
      "changes": [
        "Fixed an issue when submitting upgrades for Starbases tier 2 and higher would return the items to the inventory",
        "Changed the behavior of the Stop Mining button so that it doesn't get stuck on 'Awaiting Transaction' any longer"
      ]
    },
    {
      "version": "3.0.67",
      "changes": [
        "Changed Loyalty Points redemption and ATLAS claiming from trying to use the hot wallet"
      ]
    },
    {
      "version": "3.0.65",
      "changes": ["Changed the SDU Starbase Upgrade to award more Loyalty Points"]
    },
    {
      "version": "3.0.64",
      "changes": ["Fixed an issue where players were unable to cancel crafting"]
    },
    {
      "version": "3.0.61",
      "changes": ["Fixed an issue where players were unable to start crafting using the hot wallet"]
    },
    {
      "version": "3.0.59",
      "changes": [
        "ATLAS Prime is now available again",
        "Hot wallets and Vault have been added",
        "ATLAS Prime will use the Vault's ATLAS and SOL to pay for transactions",
        "Hot wallets offer a new way of auto-approving transactions by utilizing the ATLAS and SOL in the Vault"
      ]
    },
    {
      "version": "3.0.51",
      "changes": ["Adjusted the RPC configuration"]
    },
    {
      "version": "3.0.48",
      "changes": ["Added SDUs per scan to fleet stats table"]
    },
    {
      "version": "3.0.46",
      "changes": [
        "Fleets now gather SDUs according to a new, aggregated, SDU/Scan stat",
        "Removed global SDU per minute and fleet SDU per scan limits",
        "Added sector logic to determine the number of SDUs that can be discovered per scan (max theoretical of 1000 SDU/scan)",
        "Data Runner ships now receive a boost to their SDU/Scan stat",
        "Data Runner ships do not consume Food or Toolkits when scanning",
        "Increased scan cooldown times",
        "Increased regeneration period for sector scan chance",
        "Removed windfall SDU drops",
        "Reduced Starbase Food requirements by 33%",
        "Reduced both Food and Toolkit scaling requirements by half. (Ex: Tier 2 will be 1.5x tier 1 requirements whereas before it was 2x.",
        "Framework 2 and Toolkits 2 now require 1 steel (reduced from 2)"
      ]
    },
    {
      "version": "3.0.45",
      "changes": [
        "Removed old wallet code for Solflare which should resolve some issues their users were having"
      ]
    },
    {
      "version": "3.0.44",
      "changes": [
        "Fixed an issue where a fleet displayed the incorrect amount of ships in the fleet"
      ]
    },
    {
      "version": "3.0.42",
      "changes": [
        "Fixed an issue where a character could be partially initialized which blocked players from depositing ships or resources"
      ]
    },
    {
      "version": "3.0.41",
      "changes": ["Fixed an issue where players could not start crafting recipes above Tier 1"]
    },
    {
      "version": "3.0.40",
      "changes": [
        "Added an indicator at the right bottom of the screen to show if there's any pending transactions"
      ]
    },
    {
      "version": "3.0.39",
      "changes": [
        "Display mining-related values and calculations for Armstrong ships should now be shown correctly"
      ]
    },
    {
      "version": "3.0.38",
      "changes": [
        "Fuel, ammo and cargo for mining and subwarping fleets is now visualized in real-time",
        "The settings interface has been renewed",
        "Docked fleets now show the same sector name as undocked fleets",
        "Several improvements for mobile devices",
        "Mining now shows a countdown timer in the fleet status"
      ]
    },
    {
      "version": "3.0.35",
      "changes": ["The fleet disband confirmation dialog now closes upon confirmation"]
    },
    {
      "version": "3.0.34",
      "changes": [
        "Estimated food used for mining is now calculated properly",
        "Transaction sending for stop mining is now more explicit",
        "Added a confirmation for disband fleet button"
      ]
    },
    {
      "version": "3.0.32",
      "changes": [
        "Added a changelog to the settings menu",
        "Fixed flashing cargo in in the fleet tooltip",
        "Improved fleet statuses",
        "Removed fixed width of player fleets container",
        "Exclude respawned fleets in hangar actions",
        "Fixed the fleet mining view so it doesn't cause blank screens",
        "Calculating the mined amount is now more accurate",
        "Added a disband action to the fleet command buttons",
        "Adjusted the basic mobile dialog size for functionality"
      ]
    },
    {
      "version": "3.0.31",
      "changes": ["'Show all fleets' setting is now saved in the browser cache"]
    },
    {
      "version": "3.0.29",
      "changes": [
        "Fleet locations while warping should now render correctly",
        "Adjusted the color scheme of fleets based on the largest ship in the fleet"
      ]
    },
    {
      "version": "3.0.28",
      "changes": [
        "Fixed a bug where the map view would snap to your CSS when hovering another fleet"
      ]
    },
    {
      "version": "3.0.26",
      "changes": [
        "Fixed issues with installing finished upgrades at a starbase",
        "Fixed an issue that caused the 'partially disbanded fleets' banner to not show at all"
      ]
    },
    {
      "version": "3.0.25",
      "changes": [
        "Fixed an issue where the connection flow would not work after disconnecting",
        "Removed unused states for crafting processes causing them to appear as 'Pending Materials'",
        "Show the correct status for claimed crafts",
        "Fixed an issue when switching wallets"
      ]
    },
    {
      "version": "3.0.21",
      "changes": [
        "Clicking on an amount in the inventory will now put it in the input field",
        "Made the font size for some values dynamic to fit larger values better inside of the views"
      ]
    },
    {
      "version": "3.0.18",
      "changes": ["Fixed the wallet not being able to auto-connect"]
    },
    {
      "version": "3.0.17",
      "changes": ["Fixed scanning on sectors with a starbase"]
    },
    {
      "version": "3.0.16",
      "changes": ["Show food balance instead of toolkit balance in the sector survey overview"]
    },
    {
      "version": "3.0.15",
      "changes": ["Better disconnect logic and profile updating"]
    },
    {
      "version": "3.0.5",
      "changes": ["Fixed the wallet selection being stuck with a greyed out continue button"]
    },
    {
      "version": "3.0.3",
      "changes": ["Fixed the terms and conditions dialog having some weird styling"]
    },
    {
      "version": "3.0.0",
      "changes": ["Welcome to SAGE Labs Starbased!"]
    }
  ]
}
